avrdudes/avr-libc/include/avr/ioavr16eb28.h
/*
--------------------------------------------------------------------------
ADC - Analog to Digital Converter
--------------------------------------------------------------------------
*/

/* Analog to Digital Converter */
typedef struct ADC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status register */
    register8_t DBGCTRL;  /* Debug Control */
    register8_t CTRLE;  /* Control E */
    register8_t CTRLF;  /* Control F */
    register8_t COMMAND;  /* Command register */
    register8_t PGACTRL;  /* PGA Control */
    register8_t MUXPOS;  /* Positive Input Multiplexer */
    register8_t MUXNEG;  /* Negative Input Multiplexer */
    register8_t reserved_1[2];
    _DWORDREGISTER(RESULT);  /* Result */
    _WORDREGISTER(SAMPLE);  /* Sample */
    register8_t reserved_2[2];
    register8_t TEMP0;  /* Temporary Data 0 */
    register8_t TEMP1;  /* Temporary Data 1 */
    register8_t TEMP2;  /* Temporary Data 2 */
    register8_t reserved_3[1];
    _WORDREGISTER(WINLT);  /* Window Low Threshold */
    _WORDREGISTER(WINHT);  /* Window High Threshold */
    register8_t reserved_4[32];
} ADC_t;

/* Sign Chopping select bit group values */
typedef enum ADC_CHOPPING_VALUES_enum
{
    ADC_CHOPPING_DISABLE_gv        = 0x00,  /* Sign Chopping Disabled */
    ADC_CHOPPING_ENABLE_gv         = 0x01   /* Sign Chopping Enabled */
} ADC_CHOPPING_values_t;

/* Sign Chopping select bit group configurations*/
typedef enum ADC_CHOPPING_enum
{
    ADC_CHOPPING_DISABLE_gc        = (ADC_CHOPPING_DISABLE_gv << ADC_CHOPPING_bp),  /* Sign Chopping Disabled */
    ADC_CHOPPING_ENABLE_gc         = (ADC_CHOPPING_ENABLE_gv << ADC_CHOPPING_bp)   /* Sign Chopping Enabled */
} ADC_CHOPPING_t;

/* Gain select bit group values */
typedef enum ADC_GAIN_VALUES_enum
{
    ADC_GAIN_1X_gv                 = 0x00,  /* 1x gain */
    ADC_GAIN_2X_gv                 = 0x01,  /* 2x gain */
    ADC_GAIN_4X_gv                 = 0x02,  /* 4x gain */
    ADC_GAIN_8X_gv                 = 0x03,  /* 8x gain */
    ADC_GAIN_16X_gv                = 0x04   /* 16x gain */
} ADC_GAIN_values_t;

/* Gain select bit group configurations*/
typedef enum ADC_GAIN_enum
{
    ADC_GAIN_1X_gc                 = (ADC_GAIN_1X_gv << ADC_GAIN_gp),  /* 1x gain */
    ADC_GAIN_2X_gc                 = (ADC_GAIN_2X_gv << ADC_GAIN_gp),  /* 2x gain */
    ADC_GAIN_4X_gc                 = (ADC_GAIN_4X_gv << ADC_GAIN_gp),  /* 4x gain */
    ADC_GAIN_8X_gc                 = (ADC_GAIN_8X_gv << ADC_GAIN_gp),  /* 8x gain */
    ADC_GAIN_16X_gc                = (ADC_GAIN_16X_gv << ADC_GAIN_gp)   /* 16x gain */
} ADC_GAIN_t;

/* Mode select bit group values */
typedef enum ADC_MODE_VALUES_enum
{
    ADC_MODE_SINGLE_8BIT_gv        = 0x00,  /* Single Conversion with 8-bit resolution */
    ADC_MODE_SINGLE_12BIT_gv       = 0x01,  /* Single Conversion with 12-bit resolution */
    ADC_MODE_SERIES_gv             = 0x02,  /* Series with accumulation, separate trigger for every 12-bit conversion */
    ADC_MODE_SERIES_SCALING_gv     = 0x03,  /* Series with accumulation and scaling, separate trigger for every 12-bit conversion */
    ADC_MODE_BURST_gv              = 0x04,  /* Burst with accumulation, one trigger will run SAMPNUM 12-bit conversions */
    ADC_MODE_BURST_SCALING_gv      = 0x05   /* Burst with accumulation and scaling, one trigger will run SAMPNUM 12-bit conversions */
} ADC_MODE_values_t;

/* Mode select bit group configurations*/
typedef enum ADC_MODE_enum
{
    ADC_MODE_SINGLE_8BIT_gc        = (ADC_MODE_SINGLE_8BIT_gv << ADC_MODE_gp),  /* Single Conversion with 8-bit resolution */
    ADC_MODE_SINGLE_12BIT_gc       = (ADC_MODE_SINGLE_12BIT_gv << ADC_MODE_gp),  /* Single Conversion with 12-bit resolution */
    ADC_MODE_SERIES_gc             = (ADC_MODE_SERIES_gv << ADC_MODE_gp),  /* Series with accumulation, separate trigger for every 12-bit conversion */
    ADC_MODE_SERIES_SCALING_gc     = (ADC_MODE_SERIES_SCALING_gv << ADC_MODE_gp),  /* Series with accumulation and scaling, separate trigger for every 12-bit conversion */
    ADC_MODE_BURST_gc              = (ADC_MODE_BURST_gv << ADC_MODE_gp),  /* Burst with accumulation, one trigger will run SAMPNUM 12-bit conversions */
    ADC_MODE_BURST_SCALING_gc      = (ADC_MODE_BURST_SCALING_gv << ADC_MODE_gp)   /* Burst with accumulation and scaling, one trigger will run SAMPNUM 12-bit conversions */
} ADC_MODE_t;

/* Analog Channel Selection Bits bit group values */
typedef enum ADC_MUXNEG_VALUES_enum
{
    ADC_MUXNEG_AIN0_gv             = 0x00,  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gv             = 0x01,  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gv             = 0x02,  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gv             = 0x03,  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXNEG_AIN16_gv            = 0x10,  /* ADC input pin 16 */
    ADC_MUXNEG_AIN17_gv            = 0x11,  /* ADC input pin 17 */
    ADC_MUXNEG_AIN22_gv            = 0x16,  /* ADC input pin 22 */
    ADC_MUXNEG_AIN23_gv            = 0x17,  /* ADC input pin 23 */
    ADC_MUXNEG_AIN24_gv            = 0x18,  /* ADC input pin 24 */
    ADC_MUXNEG_AIN25_gv            = 0x19,  /* ADC input pin 25 */
    ADC_MUXNEG_AIN26_gv            = 0x1A,  /* ADC input pin 26 */
    ADC_MUXNEG_AIN27_gv            = 0x1B,  /* ADC input pin 27 */
    ADC_MUXNEG_AIN28_gv            = 0x1C,  /* ADC input pin 28 */
    ADC_MUXNEG_AIN29_gv            = 0x1D,  /* ADC input pin 29 */
    ADC_MUXNEG_AIN30_gv            = 0x1E,  /* ADC input pin 30 */
    ADC_MUXNEG_AIN31_gv            = 0x1F,  /* ADC input pin 31 */
    ADC_MUXNEG_GND_gv              = 0x30,  /* Ground */
    ADC_MUXNEG_DAC0_gv             = 0x38,  /* Digital to Analog Converter 0 */
    ADC_MUXNEG_DACREF0_gv          = 0x39,  /* AC0 DAC reference */
    ADC_MUXNEG_DACREF1_gv          = 0x3A   /* AC1 DAC reference */
} ADC_MUXNEG_values_t;

/* Analog Channel Selection Bits bit group configurations*/
typedef enum ADC_MUXNEG_enum
{
    ADC_MUXNEG_AIN0_gc             = (ADC_MUXNEG_AIN0_gv << ADC_MUXNEG_gp),  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gc             = (ADC_MUXNEG_AIN1_gv << ADC_MUXNEG_gp),  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gc             = (ADC_MUXNEG_AIN2_gv << ADC_MUXNEG_gp),  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gc             = (ADC_MUXNEG_AIN3_gv << ADC_MUXNEG_gp),  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gc             = (ADC_MUXNEG_AIN4_gv << ADC_MUXNEG_gp),  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gc             = (ADC_MUXNEG_AIN5_gv << ADC_MUXNEG_gp),  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gc             = (ADC_MUXNEG_AIN6_gv << ADC_MUXNEG_gp),  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gc             = (ADC_MUXNEG_AIN7_gv << ADC_MUXNEG_gp),  /* ADC input pin 7 */
    ADC_MUXNEG_AIN16_gc            = (ADC_MUXNEG_AIN16_gv << ADC_MUXNEG_gp),  /* ADC input pin 16 */
    ADC_MUXNEG_AIN17_gc            = (ADC_MUXNEG_AIN17_gv << ADC_MUXNEG_gp),  /* ADC input pin 17 */
    ADC_MUXNEG_AIN22_gc            = (ADC_MUXNEG_AIN22_gv << ADC_MUXNEG_gp),  /* ADC input pin 22 */
    ADC_MUXNEG_AIN23_gc            = (ADC_MUXNEG_AIN23_gv << ADC_MUXNEG_gp),  /* ADC input pin 23 */
    ADC_MUXNEG_AIN24_gc            = (ADC_MUXNEG_AIN24_gv << ADC_MUXNEG_gp),  /* ADC input pin 24 */
    ADC_MUXNEG_AIN25_gc            = (ADC_MUXNEG_AIN25_gv << ADC_MUXNEG_gp),  /* ADC input pin 25 */
    ADC_MUXNEG_AIN26_gc            = (ADC_MUXNEG_AIN26_gv << ADC_MUXNEG_gp),  /* ADC input pin 26 */
    ADC_MUXNEG_AIN27_gc            = (ADC_MUXNEG_AIN27_gv << ADC_MUXNEG_gp),  /* ADC input pin 27 */
    ADC_MUXNEG_AIN28_gc            = (ADC_MUXNEG_AIN28_gv << ADC_MUXNEG_gp),  /* ADC input pin 28 */
    ADC_MUXNEG_AIN29_gc            = (ADC_MUXNEG_AIN29_gv << ADC_MUXNEG_gp),  /* ADC input pin 29 */
    ADC_MUXNEG_AIN30_gc            = (ADC_MUXNEG_AIN30_gv << ADC_MUXNEG_gp),  /* ADC input pin 30 */
    ADC_MUXNEG_AIN31_gc            = (ADC_MUXNEG_AIN31_gv << ADC_MUXNEG_gp),  /* ADC input pin 31 */
    ADC_MUXNEG_GND_gc              = (ADC_MUXNEG_GND_gv << ADC_MUXNEG_gp),  /* Ground */
    ADC_MUXNEG_DAC0_gc             = (ADC_MUXNEG_DAC0_gv << ADC_MUXNEG_gp),  /* Digital to Analog Converter 0 */
    ADC_MUXNEG_DACREF0_gc          = (ADC_MUXNEG_DACREF0_gv << ADC_MUXNEG_gp),  /* AC0 DAC reference */
    ADC_MUXNEG_DACREF1_gc          = (ADC_MUXNEG_DACREF1_gv << ADC_MUXNEG_gp)   /* AC1 DAC reference */
} ADC_MUXNEG_t;

