avrdudes/avr-libc/include/avr/ioavr16eb28.h
/* Direction select bit group configurations*/
typedef enum TCE_DIR_enum
{
    TCE_DIR_UP_gc                  = (TCE_DIR_UP_gv << TCE_DIR_bp),  /* Count up */
    TCE_DIR_DOWN_gc                = (TCE_DIR_DOWN_gv << TCE_DIR_bp)   /* Count down */
} TCE_DIR_t;

/* Event Action A select bit group values */
typedef enum TCE_EVACTA_VALUES_enum
{
    TCE_EVACTA_CNT_POSEDGE_gv      = 0x00,  /* Count on positive edge event */
    TCE_EVACTA_CNT_ANYEDGE_gv      = 0x01,  /* Count on any edge event */
    TCE_EVACTA_CNT_HIGHLVL_gv      = 0x02,  /* Count on prescaled clock while event line is 1. */
    TCE_EVACTA_UPDOWN_gv           = 0x03   /* Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1. */
} TCE_EVACTA_values_t;

/* Event Action A select bit group configurations*/
typedef enum TCE_EVACTA_enum
{
    TCE_EVACTA_CNT_POSEDGE_gc      = (TCE_EVACTA_CNT_POSEDGE_gv << TCE_EVACTA_gp),  /* Count on positive edge event */
    TCE_EVACTA_CNT_ANYEDGE_gc      = (TCE_EVACTA_CNT_ANYEDGE_gv << TCE_EVACTA_gp),  /* Count on any edge event */
    TCE_EVACTA_CNT_HIGHLVL_gc      = (TCE_EVACTA_CNT_HIGHLVL_gv << TCE_EVACTA_gp),  /* Count on prescaled clock while event line is 1. */
    TCE_EVACTA_UPDOWN_gc           = (TCE_EVACTA_UPDOWN_gv << TCE_EVACTA_gp)   /* Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1. */
} TCE_EVACTA_t;

/* Event Action B select bit group values */
typedef enum TCE_EVACTB_VALUES_enum
{
    TCE_EVACTB_NONE_gv             = 0x00,  /* No Action */
    TCE_EVACTB_UPDOWN_gv           = 0x03,  /* Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1. */
    TCE_EVACTB_RESTART_POSEDGE_gv  = 0x04,  /* Restart counter at positive edge event */
    TCE_EVACTB_RESTART_ANYEDGE_gv  = 0x05,  /* Restart counter on any edge event */
    TCE_EVACTB_RESTART_HIGHLVL_gv  = 0x06   /* Restart counter while event line is 1. */
} TCE_EVACTB_values_t;

/* Event Action B select bit group configurations*/
typedef enum TCE_EVACTB_enum
{
    TCE_EVACTB_NONE_gc             = (TCE_EVACTB_NONE_gv << TCE_EVACTB_gp),  /* No Action */
    TCE_EVACTB_UPDOWN_gc           = (TCE_EVACTB_UPDOWN_gv << TCE_EVACTB_gp),  /* Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1. */
    TCE_EVACTB_RESTART_POSEDGE_gc  = (TCE_EVACTB_RESTART_POSEDGE_gv << TCE_EVACTB_gp),  /* Restart counter at positive edge event */
    TCE_EVACTB_RESTART_ANYEDGE_gc  = (TCE_EVACTB_RESTART_ANYEDGE_gv << TCE_EVACTB_gp),  /* Restart counter on any edge event */
    TCE_EVACTB_RESTART_HIGHLVL_gc  = (TCE_EVACTB_RESTART_HIGHLVL_gv << TCE_EVACTB_gp)   /* Restart counter while event line is 1. */
} TCE_EVACTB_t;

/* High Resolution Enable select bit group values */
typedef enum TCE_HREN_VALUES_enum
{
    TCE_HREN_OFF_gv                = 0x00,  /* High Resolution Disable */
    TCE_HREN_4X_gv                 = 0x01,  /* Resolution increased by 4 (2 bits) */
    TCE_HREN_8X_gv                 = 0x02   /* Resolution increased by 4 (3 bits) */
} TCE_HREN_values_t;

/* High Resolution Enable select bit group configurations*/
typedef enum TCE_HREN_enum
{
    TCE_HREN_OFF_gc                = (TCE_HREN_OFF_gv << TCE_HREN_gp),  /* High Resolution Disable */
    TCE_HREN_4X_gc                 = (TCE_HREN_4X_gv << TCE_HREN_gp),  /* Resolution increased by 4 (2 bits) */
    TCE_HREN_8X_gc                 = (TCE_HREN_8X_gv << TCE_HREN_gp)   /* Resolution increased by 4 (3 bits) */
} TCE_HREN_t;

/* Scaled Write select bit group values */
typedef enum TCE_SCALE_VALUES_enum
{
    TCE_SCALE_NORMAL_gv            = 0x00,  /* Absolute values used when writing to CMPn, CMPnBUF and registers */
    TCE_SCALE_FRACTIONAL_gv        = 0x01   /* Fractional values used when writing to CMPn, CMPnBUF and registers */
} TCE_SCALE_values_t;

/* Scaled Write select bit group configurations*/
typedef enum TCE_SCALE_enum
{
    TCE_SCALE_NORMAL_gc            = (TCE_SCALE_NORMAL_gv << TCE_SCALE_bp),  /* Absolute values used when writing to CMPn, CMPnBUF and registers */
    TCE_SCALE_FRACTIONAL_gc        = (TCE_SCALE_FRACTIONAL_gv << TCE_SCALE_bp)   /* Fractional values used when writing to CMPn, CMPnBUF and registers */
} TCE_SCALE_t;

/* Scaling Mode select bit group values */
typedef enum TCE_SCALEMODE_VALUES_enum
{
    TCE_SCALEMODE_CENTER_gv        = 0x00,  /* CMPn registers scaled vs center (50% duty cycle) */
    TCE_SCALEMODE_BOTTOM_gv        = 0x01,  /* CMPn registers scaled vs BOTTOM (0% duty cycle) */
    TCE_SCALEMODE_TOP_gv           = 0x02,  /* CMPn registers scaled vs TOP (100% duty cycle) */
    TCE_SCALEMODE_TOPBOTTOM_gv     = 0x03   /* CMPn registers scaled vs TOP or BOTTOM depending on written value. */
} TCE_SCALEMODE_values_t;

/* Scaling Mode select bit group configurations*/
typedef enum TCE_SCALEMODE_enum
{
    TCE_SCALEMODE_CENTER_gc        = (TCE_SCALEMODE_CENTER_gv << TCE_SCALEMODE_gp),  /* CMPn registers scaled vs center (50% duty cycle) */
    TCE_SCALEMODE_BOTTOM_gc        = (TCE_SCALEMODE_BOTTOM_gv << TCE_SCALEMODE_gp),  /* CMPn registers scaled vs BOTTOM (0% duty cycle) */
    TCE_SCALEMODE_TOP_gc           = (TCE_SCALEMODE_TOP_gv << TCE_SCALEMODE_gp),  /* CMPn registers scaled vs TOP (100% duty cycle) */
    TCE_SCALEMODE_TOPBOTTOM_gc     = (TCE_SCALEMODE_TOPBOTTOM_gv << TCE_SCALEMODE_gp)   /* CMPn registers scaled vs TOP or BOTTOM depending on written value. */
} TCE_SCALEMODE_t;

/* Waveform generation mode select bit group values */
typedef enum TCE_WGMODE_VALUES_enum
{
    TCE_WGMODE_NORMAL_gv           = 0x00,  /* Normal Mode */
    TCE_WGMODE_FRQ_gv              = 0x01,  /* Frequency Generation Mode */
    TCE_WGMODE_SINGLESLOPE_gv      = 0x03,  /* Single Slope PWM */
    TCE_WGMODE_DSTOP_gv            = 0x05,  /* Dual Slope PWM, overflow on TOP */
    TCE_WGMODE_DSBOTH_gv           = 0x06,  /* Dual Slope PWM, overflow on TOP and BOTTOM */
    TCE_WGMODE_DSBOTTOM_gv         = 0x07   /* Dual Slope PWM, overflow on BOTTOM */
} TCE_WGMODE_values_t;

/* Waveform generation mode select bit group configurations*/
typedef enum TCE_WGMODE_enum
{
    TCE_WGMODE_NORMAL_gc           = (TCE_WGMODE_NORMAL_gv << TCE_WGMODE_gp),  /* Normal Mode */
    TCE_WGMODE_FRQ_gc              = (TCE_WGMODE_FRQ_gv << TCE_WGMODE_gp),  /* Frequency Generation Mode */
    TCE_WGMODE_SINGLESLOPE_gc      = (TCE_WGMODE_SINGLESLOPE_gv << TCE_WGMODE_gp),  /* Single Slope PWM */
    TCE_WGMODE_DSTOP_gc            = (TCE_WGMODE_DSTOP_gv << TCE_WGMODE_gp),  /* Dual Slope PWM, overflow on TOP */
    TCE_WGMODE_DSBOTH_gc           = (TCE_WGMODE_DSBOTH_gv << TCE_WGMODE_gp),  /* Dual Slope PWM, overflow on TOP and BOTTOM */
    TCE_WGMODE_DSBOTTOM_gc         = (TCE_WGMODE_DSBOTTOM_gv << TCE_WGMODE_gp)   /* Dual Slope PWM, overflow on BOTTOM */
} TCE_WGMODE_t;

