avrdudes/avr-libc/include/avr/ioavr16eb28.h
/* Fault Detection Restart Mode select bit group values */
typedef enum WEX_FDMODE_VALUES_enum
{
    WEX_FDMODE_LATCHED_gv          = 0x00,  /* Latched Mode. Output will remain in fault state until fault condition is no longer active and FDF is cleared by SW. */
    WEX_FDMODE_CBC_gv              = 0x01   /* Cycle-by-cycle mode. Waveform output will remain in fault state until fault condition is no longer active. */
} WEX_FDMODE_values_t;

/* Fault Detection Restart Mode select bit group configurations*/
typedef enum WEX_FDMODE_enum
{
    WEX_FDMODE_LATCHED_gc          = (WEX_FDMODE_LATCHED_gv << WEX_FDMODE_bp),  /* Latched Mode. Output will remain in fault state until fault condition is no longer active and FDF is cleared by SW. */
    WEX_FDMODE_CBC_gc              = (WEX_FDMODE_CBC_gv << WEX_FDMODE_bp)   /* Cycle-by-cycle mode. Waveform output will remain in fault state until fault condition is no longer active. */
} WEX_FDMODE_t;

/* Fault Detection State select bit group values */
typedef enum WEX_FDSTATE_VALUES_enum
{
    WEX_FDSTATE_NORMAL_gv          = 0x00,  /* Normal state */
    WEX_FDSTATE_FAULT_gv           = 0x01   /* Fault state */
} WEX_FDSTATE_values_t;

/* Fault Detection State select bit group configurations*/
typedef enum WEX_FDSTATE_enum
{
    WEX_FDSTATE_NORMAL_gc          = (WEX_FDSTATE_NORMAL_gv << WEX_FDSTATE_bp),  /* Normal state */
    WEX_FDSTATE_FAULT_gc           = (WEX_FDSTATE_FAULT_gv << WEX_FDSTATE_bp)   /* Fault state */
} WEX_FDSTATE_t;

/* Fault Event Filter Enable select bit group values */
typedef enum WEX_FILTER_VALUES_enum
{
    WEX_FILTER_ZERO_gv             = 0x00,  /* No digital filter */
    WEX_FILTER_SAMPLE1_gv          = 0x01,  /* One Sample */
    WEX_FILTER_SAMPLE2_gv          = 0x02,  /* Two Samples */
    WEX_FILTER_SAMPLE3_gv          = 0x03,  /* Three Samples */
    WEX_FILTER_SAMPLE4_gv          = 0x04,  /* Four Samples */
    WEX_FILTER_SAMPLE5_gv          = 0x05,  /* Five Samples */
    WEX_FILTER_SAMPLE6_gv          = 0x06,  /* Six Samples */
    WEX_FILTER_SAMPLE7_gv          = 0x07   /* Seven Samples */
} WEX_FILTER_values_t;

/* Fault Event Filter Enable select bit group configurations*/
typedef enum WEX_FILTER_enum
{
    WEX_FILTER_ZERO_gc             = (WEX_FILTER_ZERO_gv << WEX_FILTER_gp),  /* No digital filter */
    WEX_FILTER_SAMPLE1_gc          = (WEX_FILTER_SAMPLE1_gv << WEX_FILTER_gp),  /* One Sample */
    WEX_FILTER_SAMPLE2_gc          = (WEX_FILTER_SAMPLE2_gv << WEX_FILTER_gp),  /* Two Samples */
    WEX_FILTER_SAMPLE3_gc          = (WEX_FILTER_SAMPLE3_gv << WEX_FILTER_gp),  /* Three Samples */
    WEX_FILTER_SAMPLE4_gc          = (WEX_FILTER_SAMPLE4_gv << WEX_FILTER_gp),  /* Four Samples */
    WEX_FILTER_SAMPLE5_gc          = (WEX_FILTER_SAMPLE5_gv << WEX_FILTER_gp),  /* Five Samples */
    WEX_FILTER_SAMPLE6_gc          = (WEX_FILTER_SAMPLE6_gv << WEX_FILTER_gp),  /* Six Samples */
    WEX_FILTER_SAMPLE7_gc          = (WEX_FILTER_SAMPLE7_gv << WEX_FILTER_gp)   /* Seven Samples */
} WEX_FILTER_t;

/* Input Matrix select bit group values */
typedef enum WEX_INMX_VALUES_enum
{
    WEX_INMX_DIRECT_gv             = 0x00,  /* Direct from TCE0 */
    WEX_INMX_CWCMA_gv              = 0x02,  /* Common Waveform Channel Mode A. Single WO */
    WEX_INMX_CWCMB_gv              = 0x03   /* Common Waveform Channel Mode B. WO from two PWM channels */
} WEX_INMX_values_t;

/* Input Matrix select bit group configurations*/
typedef enum WEX_INMX_enum
{
    WEX_INMX_DIRECT_gc             = (WEX_INMX_DIRECT_gv << WEX_INMX_gp),  /* Direct from TCE0 */
    WEX_INMX_CWCMA_gc              = (WEX_INMX_CWCMA_gv << WEX_INMX_gp),  /* Common Waveform Channel Mode A. Single WO */
    WEX_INMX_CWCMB_gc              = (WEX_INMX_CWCMB_gv << WEX_INMX_gp)   /* Common Waveform Channel Mode B. WO from two PWM channels */
} WEX_INMX_t;

/* Update Source select bit group values */
typedef enum WEX_UPDSRC_VALUES_enum
{
    WEX_UPDSRC_TCPWM0_gv           = 0x00,  /* Timer/Counter for PWM 0 update condition */
    WEX_UPDSRC_SW_gv               = 0x03   /* Software update only. No hardware update condition */
} WEX_UPDSRC_values_t;

/* Update Source select bit group configurations*/
typedef enum WEX_UPDSRC_enum
{
    WEX_UPDSRC_TCPWM0_gc           = (WEX_UPDSRC_TCPWM0_gv << WEX_UPDSRC_gp),  /* Timer/Counter for PWM 0 update condition */
    WEX_UPDSRC_SW_gc               = (WEX_UPDSRC_SW_gv << WEX_UPDSRC_gp)   /* Software update only. No hardware update condition */
} WEX_UPDSRC_t;
/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORTA              (*(VPORT_t *) 0x0000) /* Virtual Ports */
#define VPORTC              (*(VPORT_t *) 0x0008) /* Virtual Ports */
#define VPORTD              (*(VPORT_t *) 0x000C) /* Virtual Ports */
#define VPORTF              (*(VPORT_t *) 0x0014) /* Virtual Ports */
#define GPR                   (*(GPR_t *) 0x001C) /* General Purpose Registers */
#define RSTCTRL           (*(RSTCTRL_t *) 0x0040) /* Reset controller */
#define SLPCTRL           (*(SLPCTRL_t *) 0x0050) /* Sleep Controller */
#define CLKCTRL           (*(CLKCTRL_t *) 0x0060) /* Clock controller */
#define BOD                   (*(BOD_t *) 0x00A0) /* Bod interface */
#define VREF                 (*(VREF_t *) 0x00B0) /* Voltage reference */
#define WDT                   (*(WDT_t *) 0x0100) /* Watch-Dog Timer */
#define CPUINT             (*(CPUINT_t *) 0x0110) /* Interrupt Controller */
#define CRCSCAN           (*(CRCSCAN_t *) 0x0120) /* CRCSCAN */
#define RTC                   (*(RTC_t *) 0x0140) /* Real-Time Counter */
#define CCL                   (*(CCL_t *) 0x01C0) /* Configurable Custom Logic */
#define EVSYS               (*(EVSYS_t *) 0x0200) /* Event System */
#define PORTA                (*(PORT_t *) 0x0400) /* I/O Ports */
#define PORTC                (*(PORT_t *) 0x0440) /* I/O Ports */
#define PORTD                (*(PORT_t *) 0x0460) /* I/O Ports */
#define PORTF                (*(PORT_t *) 0x04A0) /* I/O Ports */
#define PORTMUX           (*(PORTMUX_t *) 0x05E0) /* Port Multiplexer */
#define ADC0                  (*(ADC_t *) 0x0600) /* Analog to Digital Converter */
#define AC0                    (*(AC_t *) 0x0680) /* Analog Comparator */
#define AC1                    (*(AC_t *) 0x0688) /* Analog Comparator */
#define USART0              (*(USART_t *) 0x0800) /* Universal Synchronous and Asynchronous Receiver and Transmitter */
#define TWI0                  (*(TWI_t *) 0x0900) /* Two-Wire Interface */
#define SPI0                  (*(SPI_t *) 0x0940) /* Serial Peripheral Interface */
#define TCE0                  (*(TCE_t *) 0x0A00) /* 16-bit Timer/Counter Type E */
#define TCB0                  (*(TCB_t *) 0x0B00) /* 16-bit Timer/Counter Type B */
#define TCB1                  (*(TCB_t *) 0x0B10) /* 16-bit Timer/Counter Type B */
#define TCF0                  (*(TCF_t *) 0x0C00) /* 24-bit Timer/Counter for frequency generation */
#define WEX0                  (*(WEX_t *) 0x0C80) /* Waveform Extension */
#define SYSCFG             (*(SYSCFG_t *) 0x0F00) /* System Configuration Registers */
#define NVMCTRL           (*(NVMCTRL_t *) 0x1000) /* Non-volatile Memory Controller */
#define LOCK                 (*(LOCK_t *) 0x1040) /* Lockbits */
#define FUSE                 (*(FUSE_t *) 0x1050) /* Fuses */
#define SIGROW             (*(SIGROW_t *) 0x1080) /* Signature row */
#define BOOTROW           (*(BOOTROW_t *) 0x1100) /* Boot Row */
#define USERROW           (*(USERROW_t *) 0x1200) /* User Row */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* VPORT (VPORTA) - Virtual Ports */
#define VPORTA_DIR  _SFR_MEM8(0x0000)
#define VPORTA_OUT  _SFR_MEM8(0x0001)
#define VPORTA_IN  _SFR_MEM8(0x0002)
#define VPORTA_INTFLAGS  _SFR_MEM8(0x0003)


